Repository: SerhiiAloshkin/SudokuiOS
Catalog: SudokuiOS/Localizable.xcstrings
Source language: en
Languages: fr, uk

source: --------------------------------- Technical details for support: App Version: %1$@ (%2$@) iOS Version: %3$@ Device Model: %4$@
fr: --------------------------------- Détails techniques pour l'assistance : Version de l'app : %1$@ (%2$@) Version iOS : %3$@ Modèle d'appareil : %4$@
uk: --------------------------------- Технічні дані для підтримки: Версія програми: %1$@ (%2$@) Версія iOS: %3$@ Модель пристрою: %4$@

source: "%@" will be permanently deleted. This cannot be undone.
fr: « %@ » sera définitivement supprimé. Cette action est irréversible.
uk: «%@» буде остаточно видалено. Цю дію неможливо скасувати.

source: "19" Button
fr: Bouton « 19 »
uk: Кнопка «19»

source: (Detailed Mode) Highlights the selected cell's row, column, and 3x3 box, showing all rules affecting that spot.
fr: (Mode Détaillé) Met en surbrillance la ligne, la colonne et le bloc 3x3 de la cellule sélectionnée, montrant toutes les règles affectant cet emplacement.
uk: (Детальний режим) Підсвічує рядок, стовпець і блок 3x3 вибраної клітинки, показуючи всі правила, що впливають на це місце.

source: (Detailed Mode) Visually reveals all valid empty spots where your selected number could be placed.
fr: (Mode Détaillé) Révèle visuellement tous les emplacements vides valides où votre chiffre sélectionné pourrait être placé.
uk: (Детальний режим) Візуально показує всі дійсні порожні місця, куди можна поставити вибране число.

source: %lld cells
fr: %lld cellules
uk: %lld клітинок

source: • **Immediately**: Flags errors in red the moment they are entered. • **When Board Full**: Only reveals errors once the grid is finished. • **Never**: Mistakes are never flagged.
fr: • **Immédiatement** : signale les erreurs en rouge dès leur saisie. • **Grille pleine** : ne révèle les erreurs qu'une fois la grille terminée. • **Jamais** : les erreurs ne sont jamais signalées.
uk: • **Одразу**: позначає помилки червоним одразу після введення. • **Коли дошка заповнена**: показує помилки лише після заповнення сітки. • **Ніколи**: помилки ніколи не позначаються.

source: • **Selected Cell**: Forces the Hint engine to analyze your current focus. • **Random Cell**: Finds the single most logical deduction anywhere on the board.
fr: • **Cellule sélectionnée** : force le moteur d'indices à analyser votre sélection actuelle. • **Cellule aléatoire** : trouve la déduction la plus logique n'importe où sur la grille.
uk: • **Вибрана клітинка**: змушує механізм підказок аналізувати поточний фокус. • **Випадкова клітинка**: знаходить найлогічніший висновок будь-де на дошці.

source: ✨ Perfect Game! 0 Mistakes ✨
fr: ✨ Partie parfaite ! 0 erreur ✨
uk: ✨ Ідеальна гра! 0 помилок ✨

source: ✨ Perfect Run ✨
fr: ✨ Partie parfaite ✨
uk: ✨ Ідеальний прохід ✨

source: A number dims once you've placed it 9 times on the board. Turn off "Disable Completed Digits" in Settings to keep using it anyway.
fr: Un chiffre s'estompe une fois placé 9 fois sur la grille. Désactivez « Désactiver les chiffres complétés » dans les réglages pour continuer à l'utiliser.
uk: Число тьмяніє, коли ви розмістили його 9 разів на дошці. Вимкніть «Вимикати завершені цифри» в налаштуваннях, щоб продовжити ним користуватися.

source: Activate Anyway
fr: Activer quand même
uk: Увімкнути попри все

source: Adjacent 1 and 9 (Empty)
fr: 1 et 9 adjacents (vide)
uk: 1 і 9 поруч (порожньо)

source: Adjacent cells (including diagonals) cannot contain the same number.
fr: Les cellules adjacentes (y compris en diagonale) ne peuvent pas contenir le même chiffre.
uk: Сусідні клітинки (включно з діагоналями) не можуть містити однакове число.

source: Adjacent cells cannot contain consecutive numbers (e.g. 4 & 5).
fr: Les cellules adjacentes ne peuvent pas contenir de chiffres consécutifs (ex. 4 et 5).
uk: Сусідні клітинки не можуть містити послідовні числа (напр. 4 і 5).

source: Adjacent cells cannot contain consecutive numbers.
fr: Les cellules adjacentes ne peuvent pas contenir de chiffres consécutifs.
uk: Сусідні клітинки не можуть містити послідовні числа.

source: All Levels
fr: Tous les niveaux
uk: Усі рівні

source: Amazing!
fr: Incroyable !
uk: Дивовижно!

source: Analyzes the board logically and provides a step-by-step deduction to help you progress. Has a 5-minute cooldown after each use, shown as a countdown on the button itself.
fr: Analyse la grille logiquement et fournit une déduction étape par étape pour vous aider à progresser. Un délai de 5 minutes s'applique après chaque utilisation, affiché en compte à rebours sur le bouton.
uk: Логічно аналізує дошку та надає покрокову підказку для прогресу. Має 5-хвилинну затримку після кожного використання, яка показана як зворотний відлік на самій кнопці.

source: Appearance
fr: Apparence
uk: Вигляд

source: Appears only on Sandwich levels. Adds or removes notes for 1 and 9 across your selected empty cells, based on where each is currently a valid candidate.
fr: Apparaît uniquement sur les niveaux Sandwich. Ajoute ou retire les notes 1 et 9 sur vos cellules vides sélectionnées, selon que chacune est actuellement un candidat valide.
uk: З'являється лише на рівнях «Сандвіч». Додає або видаляє нотатки 1 і 9 у вибраних порожніх клітинках, залежно від того, де кожна з них наразі є дійсним кандидатом.

source: Applies background colors to cells. Essential for advanced logical techniques like 'Coloring'. Tap the circle-slash swatch to clear a cell's color.
fr: Applique des couleurs de fond aux cellules. Essentiel pour des techniques logiques avancées comme le « coloriage ». Touchez la pastille barrée pour effacer la couleur d'une cellule.
uk: Застосовує кольори фону до клітинок. Необхідно для просунутих логічних технік, як-от «розфарбовування». Торкніться перекресленого кола, щоб прибрати колір клітинки.

source: Are you sure?
fr: Êtes-vous sûr ?
uk: Ви впевнені?

source: Arrow
fr: Flèche
uk: Стрілка

source: Arrow Sudoku
fr: Sudoku Flèche
uk: Судоку «Стрілка»

source: ARROW SUMS
fr: SOMMES DE FLÈCHES
uk: СУМИ СТРІЛОК

source: Auto-Filter Combinations
fr: Filtrage automatique des combinaisons
uk: Автофільтрація комбінацій

source: Automatically erases candidate notes that are mathematically impossible within a cage or sandwich.
fr: Efface automatiquement les notes candidates mathématiquement impossibles dans une cage ou un sandwich.
uk: Автоматично видаляє нотатки-кандидати, які математично неможливі в клітці чи «сандвічі».

source: Automatically highlights every instance of your selected number across the entire board.
fr: Met automatiquement en surbrillance chaque occurrence du chiffre sélectionné sur toute la grille.
uk: Автоматично підсвічує кожен випадок вибраного числа на всій дошці.

source: Back to Grid
fr: Retour à la grille
uk: Назад до сітки

source: Back to Level %lld
fr: Retour au niveau %lld
uk: Назад до рівня %lld

source: BEST
fr: MEILLEUR
uk: РЕКОРД

source: Best: %@
fr: Meilleur : %@
uk: Рекорд: %@

source: Black
fr: Noir
uk: Чорний

source: Blue Square-framed cells are Even (2, 4, 6, 8). Blue Circle-framed cells are Odd (1, 3, 5, 7, 9).
fr: Les cellules encadrées d'un carré bleu sont paires (2, 4, 6, 8). Les cellules encadrées d'un cercle bleu sont impaires (1, 3, 5, 7, 9).
uk: Клітинки в синьому квадраті — парні (2, 4, 6, 8). Клітинки в синьому колі — непарні (1, 3, 5, 7, 9).

source: Brilliant!
fr: Brillant !
uk: Блискуче!

source: Cage Sum
fr: Somme de la cage
uk: Сума клітки

source: Cages must sum to the small total in the corner. Digits cannot repeat within a cage.
fr: Les cages doivent totaliser le petit nombre indiqué dans le coin. Les chiffres ne peuvent pas se répéter dans une cage.
uk: Сума клітки має дорівнювати маленькому числу в кутку. Цифри не можуть повторюватися в межах однієї клітки.

source: Cancel
fr: Annuler
uk: Скасувати

source: Cannot Send Email
fr: Impossible d'envoyer l'e-mail
uk: Не вдається надіслати листа

source: Cells a knight's move away (L-shape) cannot contain the same number.
fr: Les cellules séparées par un mouvement de cavalier (forme en L) ne peuvent pas contenir le même chiffre.
uk: Клітинки на відстані ходу коня (Г-подібно) не можуть містити однакове число.

source: Classic
fr: Classique
uk: Класичний

source: Classic and Non-Consecutive are mutually exclusive — enabling one turns off the other. King and Knight can be combined freely with either.
fr: Classique et Non-Consécutif s'excluent mutuellement — activer l'un désactive l'autre. Roi et Cavalier peuvent être combinés librement avec l'un ou l'autre.
uk: «Класичний» і «Непослідовний» взаємовиключні — увімкнення одного вимикає інший. «Король» і «Кінь» можна вільно поєднувати з будь-яким із них.

source: Classic Sudoku
fr: Sudoku Classique
uk: Класичне судоку

source: Clears digits, notes, and colors from your selected cell(s).
fr: Efface les chiffres, notes et couleurs des cellules sélectionnées.
uk: Очищує цифри, нотатки та кольори у вибраних клітинках.

source: Close Level
fr: Fermer le niveau
uk: Закрити рівень

source: Clues indicate sums between 1 and 9.
fr: Les indices indiquent des sommes entre 1 et 9.
uk: Підказки вказують суми між 1 і 9.

source: Clues outside the grid show the sum of digits sandwiched between 1 and 9.
fr: Les indices en dehors de la grille montrent la somme des chiffres pris en sandwich entre 1 et 9.
uk: Підказки за межами сітки показують суму цифр, «затиснутих» між 1 і 9.

source: Clues outside the grid show the sum of digits trapped between the 1 and the 9.
fr: Les indices en dehors de la grille indiquent la somme des chiffres pris entre le 1 et le 9.
uk: Підказки за межами сітки показують суму цифр, затиснутих між 1 і 9.

source: Color
fr: Couleur
uk: Колір

source: Combination Helpers
fr: Assistants de combinaisons
uk: Помічники комбінацій

source: Combinations for %lld
fr: Combinaisons pour %lld
uk: Комбінації для %lld

source: Complete 1-250
fr: Terminer 1-250
uk: Пройдіть 1-250

source: Complete all levels 1-250 first!
fr: Terminez d'abord tous les niveaux 1-250 !
uk: Спочатку пройдіть усі рівні 1-250!

source: Complete all previous levels (1-250) to unlock the advanced series!
fr: Terminez tous les niveaux précédents (1-250) pour débloquer la série avancée !
uk: Пройдіть усі попередні рівні (1-250), щоб відкрити серію для просунутих!

source: Complete Level %lld
fr: Terminer le niveau %lld
uk: Пройти рівень %lld

source: Complete Level %lld to unlock
fr: Terminez le niveau %lld pour débloquer
uk: Пройдіть рівень %lld, щоб розблокувати

source: Contact Us
fr: Nous contacter
uk: Зв'язатися з нами

source: Continue
fr: Continuer
uk: Продовжити

source: CONTINUE
fr: CONTINUER
uk: ПРОДОВЖИТИ

source: Continue Level
fr: Continuer le niveau
uk: Продовжити рівень

source: Copy Support Email
fr: Copier l'e-mail d'assistance
uk: Копіювати пошту підтримки

source: Create one with the Level Builder!
fr: Créez-en un avec le créateur de niveaux !
uk: Створіть його в редакторі рівнів!

source: Cross
fr: Croix
uk: Хрест

source: Cross (Sandwich)
fr: Croix (Sandwich)
uk: Хрест (Сандвіч)

source: Custom Level
fr: Niveau personnalisé
uk: Власний рівень

source: Dark
fr: Sombre
uk: Темна

source: Delete
fr: Supprimer
uk: Видалити

source: Delete Level?
fr: Supprimer le niveau ?
uk: Видалити рівень?

source: Detailed Mode
fr: Mode détaillé
uk: Детальний режим

source: Digit
fr: Chiffre
uk: Цифра

source: Digits a chess Knight's move apart cannot be identical.
fr: Les chiffres séparés par un mouvement de cavalier aux échecs ne peuvent pas être identiques.
uk: Цифри, розділені ходом шахового коня, не можуть бути однаковими.

source: Digits along the arrow line must sum to the value inside its bulb.
fr: Les chiffres le long de la ligne de flèche doivent totaliser la valeur inscrite dans son cercle.
uk: Цифри вздовж лінії стрілки мають у сумі давати значення в її кружечку.

source: Digits along the arrow sum to the number in the circle.
fr: Les chiffres le long de la flèche totalisent le chiffre dans le cercle.
uk: Цифри вздовж стрілки в сумі дають число в колі.

source: Digits in diagonally touching cells cannot be identical.
fr: Les chiffres dans des cellules qui se touchent en diagonale ne peuvent pas être identiques.
uk: Цифри в клітинках, що дотикаються по діагоналі, не можуть бути однаковими.

source: Digits increase along thermometer shapes.
fr: Les chiffres augmentent le long des formes de thermomètre.
uk: Цифри зростають уздовж форм термометра.

source: Digits must strictly increase starting from the bulb to the tip.
fr: Les chiffres doivent strictement augmenter du bulbe jusqu'à la pointe.
uk: Цифри мають суворо зростати від кульки до кінчика.

source: Disable Completed Digits
fr: Désactiver les chiffres complétés
uk: Вимикати завершені цифри

source: Displays a list of all remaining mathematical combinations for selected Killer Cages or Sandwich sums, and pre-selects every valid combination by default the first time you open a cage.
fr: Affiche la liste de toutes les combinaisons mathématiques restantes pour les cages Killer ou sommes Sandwich sélectionnées, et présélectionne chaque combinaison valide par défaut à la première ouverture d'une cage.
uk: Показує список усіх можливих математичних комбінацій для вибраних кліток Кіллер або сум «Сандвіч» і попередньо вибирає кожну дійсну комбінацію під час першого відкриття клітки.

source: Done
fr: Terminé
uk: Готово

source: Drag to Multi-Select
fr: Glisser pour sélectionner plusieurs cellules
uk: Проведіть пальцем для мультивибору

source: Drawing Shapes
fr: Dessiner des formes
uk: Малювання фігур

source: Edit
fr: Modifier
uk: Редагувати

source: Editing an Existing Level
fr: Modifier un niveau existant
uk: Редагування наявного рівня

source: Enable Mistake Limit
fr: Activer la limite d'erreurs
uk: Увімкнути ліміт помилок

source: Enable Mistake Limit (3 Strikes)
fr: Activer la limite d'erreurs (3 vies)
uk: Увімкнути ліміт помилок (3 спроби)

source: Enforces the 3-strike rule — three incorrect moves ends the game. Turning this off doesn't just skip the game-over: mistakes stop being counted entirely.
fr: Applique la règle des 3 erreurs — trois coups incorrects mettent fin à la partie. Désactiver ce réglage ne fait pas que retirer la fin de partie : les erreurs ne sont plus du tout comptabilisées.
uk: Застосовує правило 3 помилок — три неправильні ходи завершують гру. Вимкнення цього не просто скасовує завершення гри: помилки взагалі перестають рахуватися.

source: Enter
fr: Saisir
uk: Ввід

source: Enter a name, or leave blank for an auto-generated name.
fr: Saisissez un nom, ou laissez vide pour un nom généré automatiquement.
uk: Введіть назву або залиште поле порожнім для автоматичної назви.

source: Enter sum
fr: Saisir la somme
uk: Введіть суму

source: Enter the sum of digits between 1 and 9 for this column. Valid values: 0 (adjacent) or 2-35.
fr: Saisissez la somme des chiffres entre 1 et 9 pour cette colonne. Valeurs valides : 0 (adjacents) ou 2-35.
uk: Введіть суму цифр від 1 до 9 для цього стовпця. Дійсні значення: 0 (сусідні) або 2-35.

source: Enter the sum of digits between 1 and 9 for this row. Valid values: 0 (adjacent) or 2-35.
fr: Saisissez la somme des chiffres entre 1 et 9 pour cette ligne. Valeurs valides : 0 (adjacents) ou 2-35.
uk: Введіть суму цифр від 1 до 9 для цього рядка. Дійсні значення: 0 (сусідні) або 2-35.

source: Enter the target sum for this killer cage.
fr: Saisissez la somme cible de cette cage killer.
uk: Введіть цільову суму для цієї клітки Кіллер.

source: Enters final large digits. Use this when you are certain of a value.
fr: Saisit des chiffres définitifs en grand format. Utilisez ce mode lorsque vous êtes certain d'une valeur.
uk: Вводить остаточні великі цифри. Використовуйте, коли ви впевнені у значенні.

source: Enters small candidate digits for tracking possibilities.
fr: Saisit de petits chiffres candidats pour suivre les possibilités.
uk: Вводить маленькі цифри-кандидати для відстеження можливостей.

source: Erase
fr: Effacer
uk: Стерти

source: Erasing & Editing Shapes
fr: Effacer et modifier des formes
uk: Видалення та редагування фігур

source: Error
fr: Erreur
uk: Помилка

source: Even
fr: Pair
uk: Парне

source: Every tool, interaction, and rule explained.
fr: Chaque outil, interaction et règle expliqués.
uk: Кожен інструмент, взаємодія та правило пояснені.

source: Failed to save: %@
fr: Échec de l'enregistrement : %@
uk: Не вдалося зберегти: %@

source: Failed to update: %@
fr: Échec de la mise à jour : %@
uk: Не вдалося оновити: %@

source: Fantastic!
fr: Fantastique !
uk: Фантастично!

source: Filter: %@
fr: Filtre : %@
uk: Фільтр: %@

source: Finish Shape
fr: Terminer la forme
uk: Завершити фігуру

source: For Thermos, Arrows, and Cages, tap cells one at a time to extend the shape — this is a sequence of taps, not a drag. Each new tap must be adjacent to the shape.
fr: Pour les Thermomètres, Flèches et Cages, touchez les cellules une par une pour étendre la forme — il s'agit d'une série de touches, pas d'un glissement. Chaque nouvelle touche doit être adjacente à la forme.
uk: Для Термометрів, Стрілок і Кліток торкайтеся клітинок по одній, щоб подовжити фігуру — це послідовність дотиків, а не проведення пальцем. Кожен новий дотик має бути суміжним із фігурою.

source: Full Guide
fr: Guide complet
uk: Повний посібник

source: Game Over
fr: Partie terminée
uk: Гру закінчено

source: Game Screen & Controls
fr: Écran de jeu et commandes
uk: Ігровий екран і керування

source: Game Settings
fr: Réglages du jeu
uk: Налаштування гри

source: Game Types
fr: Types de jeu
uk: Типи гри

source: Gameplay
fr: Jouabilité
uk: Ігровий процес

source: Genius!
fr: Génial !
uk: Геніально!

source: Got it
fr: Compris
uk: Зрозуміло

source: Gray Circle: Odd (1,3,5...). Gray Square: Even (2,4,6...).
fr: Cercle gris : impair (1,3,5...). Carré gris : pair (2,4,6...).
uk: Сіре коло: непарне (1,3,5...). Сірий квадрат: парне (2,4,6...).

source: Greyed-Out Digits
fr: Chiffres grisés
uk: Затемнені цифри

source: Halts the timer and hides the board. Offers Continue, Reset Level (asks for confirmation), and Close Level.
fr: Arrête le chronomètre et masque la grille. Propose Continuer, Réinitialiser le niveau (avec confirmation) et Fermer le niveau.
uk: Зупиняє таймер і приховує дошку. Пропонує Продовжити, Скинути рівень (із підтвердженням) і Закрити рівень.

source: Highlight Mode
fr: Mode de surbrillance
uk: Режим підсвічування

source: Highlight only the selected cell.
fr: Ne met en surbrillance que la cellule sélectionnée.
uk: Підсвічувати лише вибрану клітинку.

source: Highlight Same Note
fr: Surligner la même note
uk: Підсвічувати однакові нотатки

source: Highlight Same Number
fr: Surligner le même chiffre
uk: Підсвічувати однакові числа

source: Highlighting With Multiple Cells Selected
fr: Surbrillance avec plusieurs cellules sélectionnées
uk: Підсвічування при виборі кількох клітинок

source: Highlights cells restricted by Sudoku rules relative to the selected cell (Row, Column, Box).
fr: Met en surbrillance les cellules restreintes par les règles du Sudoku par rapport à la cellule sélectionnée (ligne, colonne, bloc).
uk: Підсвічує клітинки, обмежені правилами судоку відносно вибраної клітинки (рядок, стовпець, блок).

source: Highlights every cell containing the same Pencil note as your current selection.
fr: Met en surbrillance chaque cellule contenant la même note Crayon que votre sélection actuelle.
uk: Підсвічує кожну клітинку з такою ж нотаткою олівцем, як і в поточному виборі.

source: Highlights valid empty spots for the selected number.
fr: Met en surbrillance les emplacements vides valides pour le chiffre sélectionné.
uk: Підсвічує дійсні порожні місця для вибраного числа.

source: Hint
fr: Indice
uk: Підказка

source: Hint Target
fr: Cible de l'indice
uk: Ціль підказки

source: Home
fr: Accueil
uk: Головна

source: How to Play
fr: Comment jouer
uk: Як грати

source: If there is NO dot between two cells, their difference CANNOT be 1 and their ratio CANNOT be 2:1.
fr: S'il n'y a AUCUN point entre deux cellules, leur différence ne peut PAS être 1 et leur rapport ne peut PAS être 2:1.
uk: Якщо між двома клітинками НЕМАЄ крапки, їхня різниця НЕ МОЖЕ дорівнювати 1, а співвідношення НЕ МОЖЕ бути 2:1.

source: Immediately
fr: Immédiatement
uk: Одразу

source: In Progress • %@
fr: En cours • %@
uk: У процесі • %@

source: In Sandwich levels, use the Cross tool to mark cells that definitely CANNOT be a 1 or a 9. **Shortcut:** Long-press to cross all empty cells.
fr: Dans les niveaux Sandwich, utilisez l'outil Croix pour marquer les cellules qui ne peuvent CERTAINEMENT pas contenir 1 ou 9. **Raccourci :** appui long pour cocher toutes les cellules vides.
uk: На рівнях «Сандвіч» використовуйте інструмент «Хрест», щоб позначити клітинки, де ТОЧНО не може бути 1 або 9. **Швидкий доступ:** утримуйте, щоб позначити всі порожні клітинки.

source: Keep it Off
fr: Laisser désactivé
uk: Залишити вимкненим

source: Killer Cage %lld
fr: Cage Killer %lld
uk: Клітка Кіллер %lld

source: KILLER CAGES
fr: CAGES KILLER
uk: КЛІТКИ КІЛЛЕР

source: Killer Sudoku
fr: Sudoku Killer
uk: Судоку «Кіллер»

source: King
fr: Roi
uk: Король

source: KING MOVE
fr: MOUVEMENT DU ROI
uk: ХІД КОРОЛЕМ

source: King Sudoku
fr: Sudoku Roi
uk: Судоку «Король»

source: Knight
fr: Cavalier
uk: Кінь

source: KNIGHT MOVE
fr: MOUVEMENT DU CAVALIER
uk: ХІД КОНЕМ

source: Knight Sudoku
fr: Sudoku Cavalier
uk: Судоку «Кінь»

source: KROPKI DOTS
fr: POINTS KROPKI
uk: КРАПКИ КРОПКІ

source: Kropki Sudoku
fr: Sudoku Kropki
uk: Судоку «Кропкі»

source: Language
fr: Langue
uk: Мова

source: Level %lld
fr: Niveau %lld
uk: Рівень %lld

source: Level Builder
fr: Créateur de niveaux
uk: Редактор рівнів

source: Level has a unique Human-Solvable solution!
fr: Ce niveau a une solution unique résoluble par un humain !
uk: Рівень має унікальний розв'язок, який можна знайти вручну!

source: Level Icons
fr: Icônes de niveaux
uk: Значки рівнів

source: Level is not cleanly Human-Solvable (Unsolved cells: %lld)
fr: Ce niveau n'est pas clairement résoluble par un humain (cellules non résolues : %lld)
uk: Рівень не є однозначно розв'язним вручну (нерозв'язаних клітинок: %lld)

source: Level name
fr: Nom du niveau
uk: Назва рівня

source: Level saved successfully!
fr: Niveau enregistré avec succès !
uk: Рівень успішно збережено!

source: Levels unlock sequentially as you progress through the game.
fr: Les niveaux se débloquent progressivement au fil de votre avancée dans le jeu.
uk: Рівні розблоковуються послідовно, у міру вашого прогресу в грі.

source: Light
fr: Clair
uk: Світла

source: Loading level...
fr: Chargement du niveau…
uk: Завантаження рівня…

source: Locked
fr: Verrouillé
uk: Заблоковано

source: Long-press the 'Multi' button to select all remaining empty cells on the board instantly.
fr: Appuyez longuement sur le bouton « Multi » pour sélectionner instantanément toutes les cellules vides restantes.
uk: Утримуйте кнопку «Мульти», щоб миттєво вибрати всі порожні клітинки на дошці.

source: Masterful!
fr: Magistral !
uk: Майстерно!

source: Minimal Highlight
fr: Surbrillance minimale
uk: Мінімальне підсвічування

source: Mistakes Found
fr: Erreurs détectées
uk: Знайдено помилки

source: Mistakes: %lld
fr: Erreurs : %lld
uk: Помилки: %lld

source: Multi-Select Highlighting
fr: Surbrillance en sélection multiple
uk: Підсвічування при мультивиборі

source: Multi-Select Shortcut
fr: Raccourci de sélection multiple
uk: Швидкий мультивибір

source: My Custom Levels
fr: Mes niveaux personnalisés
uk: Мої власні рівні

source: My Levels
fr: Mes niveaux
uk: Мої рівні

source: Name Your Level
fr: Nommez votre niveau
uk: Назвіть свій рівень

source: NEGATIVE
fr: NÉGATIF
uk: НЕГАТИВНИЙ

source: NEGATIVE CONSTRAINT
fr: CONTRAINTE NÉGATIVE
uk: НЕГАТИВНЕ ОБМЕЖЕННЯ

source: Never
fr: Jamais
uk: Ніколи

source: Next Challenge
fr: Prochain défi
uk: Наступний виклик

source: Next Level
fr: Niveau suivant
uk: Наступний рівень
